package com.example.osbb.service.pdf;

import java.util.List;

public class TextsAndLists {
    public static String appealToTheResidents = "Уважаемые жильцы!!! " +
            "Убедительная просьба платить вовремя за услуги по содержанию нашего дома." +
            " Сделаем вместе наш дом уютным и комфортным.";
    public static List<String> report_2023_11 = List.of("1. Поданы документы на участие в городской программе софинансирования (выделение денег на модернизацию системы энергоснабжения дома).",
            "2. Обратились к мэру города с просьбой о благоустройстве двора и установки забора со стороны ул.Широкой и с пр. Свободы",
            "3. Проведена обрезка кустов и кронирование деревьев.",
            "4. Установлены бетонные столбы и налажено освещение двора.",
            "5. Произведен осмотр подвальных помещений, крыши, электрощитовой и подъездов, определён объём работ.",
            "6. В подвале подъезда №2  отведено место для уборки двора  и подъездов. Наняты уборщицы.  Благодарим Владимира (квартира №40) за установку замка.",
            "7. В подвале подъезда №6 проведен свет, установлены лампочки и выключатель.",
            "8. На чердаке (над квартирой №38), в связи с аварийной ситуацией, произведена замены участка трубы длиной 2,7 метра.",
            "9. В квартире № 44 проводятся технические работы по теплоснабжению.",
            "10. Произведена замена сальника на задвижке подачи теплоносителя в подвале подъезда № 6.");

    public static List<String> report_2023_2024_winter = List.of(
            "1. Виігран суд Першої інстанції зі спірних питаннь з компанією «Лідер-Комфорт». Адвокати продовжують працювати.",
            "2. Почали процес документального оформлення землевідводу, без якого не можливе подальше планування теріторії (ворота, автостоянка, альтанка, то що).",
            "3. Виділені кошти на софінансування, але їх використання потребує певні фінансові накопичення на рахунку ОСББ.",
            "4. Були оформлені додаткові документи по ОСББ для казначейства, податкової та нотаріуса. Заключені договори з ДТЄК та підприємцями, що розташовані в нашому будинку.",
            "5. Проведені усі аварійно-технічні роботи, що пов’язані з водопостачанням, каналізацією та системою опалення.",
            "6. Висловлюєм подяку Антону – квартира №4, Зої – квартира №47, Світлані Іванівні – квартира №53 за відгукливість та допомогу в складних ситуаціях.",
            "7. Всі роботи з документами (адвокати, казначейство, нотаріус) , аварійно-технічні роботи, загальна електроєнергія, прибирання будинкової теріторії та під’їздів були сплачені з рахунку нашого ОСББ. ",
            "",
            ""
    );
    public static List<String> appealToTheResidentsList = List.of(
            "Велике прохання для всіх мешканців сплачувати за житло вчасно, а бажано наперед.",
            "",
            "Дякуємо всім мешканцям, хто своєчасно сплачує квартплату.",
            "",
            "Єднаємось та працюємо разом.");
    static List<String> forTableDebtDetails = List.of(
            "Начальный период", "Долг на начало периода, грн", "Текущий тариф, грн/м2", "Начислено, грн",
            "Монетизация субсидий, грн", "Монетизация льгот, грн",
            "Оплачено, грн", "Долг на конец период, грн", "  Конечный период  "
    );
}
